[
  "Technica Engineering GmbH, all rights reserved\nPage 1 of 12\nOnboarding\nIf you are reading this, it is most likely that you are new to the Technica family, so welcome aboard! We all have gone through the process of starting in a new job and know how complicated the first days can be, when everything is new and you can \nbarely process the huge amount of information received in a very short period of time. In order to help you during this initial phase, we have created \nsome documents with instructions, links to documentation, etc.",
  "that hopefully will be helpful for you. This should be a document complete enough to help you go through the first steps in the company. Please read it carefully and check it first before \nasking in case you have questions.",
  "If the answer is not here, this means that the document is not complete yet and the missing information needs to \nbe added; please \n about it. Along the same lines, if you have any question during the reading, do not hesitate to ask us, because it is \ninform us\npossible that we take for granted that everything is clear, but it is not, and feedback is always welcome. In any case, welcome to the Technica Engineering cocoon, where we will hopefully see you flourish \n \nAfter this short introduction, let's go to the point now!",
  "Table of contents\nWhere to start\nCompany overview\nOrganizational Chart\nPolicies & Processes\nTime tracking\nAccess chip\nVisitors\nIntranet\nMail\nResources\nCorporative image\nServices/sites\nTraining program\nSupport documents\nCertifications\nLanguage courses\nEmployee benefits\nOther\nWhere to start\nIf you are new at Technica, when you read this you will have had your onboarding session with the HR and Administration colleagues behind. This \nsession takes place once a month, on the first working day of each month, to help the new employees with the very first steps in the company:\nFirst contact with Technica office & colleagues (Responsible: HR)\nOnboarding sessions, held by our HR colleagues. Usually scheduled for 10:00 on your first working day.",
  "During this session, most \nof the subjects written in this page will be tackled. Sign your contract in paper form (Responsible: HR)\nCollect your access chip to Technica office (Responsible: Admin/HR)\nCheck in using the physical device at the entrance of the office, with your new access chip, or via web using the \n \ntime tracking system\n((Responsible: Admin/HR)\nCollect your laptop (Responsible: IT guys)\nGet your Microsoft365 login info (Responsible: HR)\nIf login to Microsoft365 and all related systems (Outlook, Teams, OneDrive) are not working, please perform a password reset with \nthe option “Forgot your password?”. Log in using the domain user and password provided by the IT department.",
  "Note that during the startup sequence you will be requested to enter the bitlocker code that you receive along with your user and \npassword. In case you want to check any of the content shown during the onboarding session, you can have access to the used presentation here:\nCompany Onboarding\nTechnica Engineering GmbH, all rights reserved\nPage 2 of 12\nAfter the onboarding session, here you have a list with the following steps to follow, most of which you will get done during your first day with us:\nGet a quick overview on the company:\nCompany Overview\nCompany Infrastructure\nAdministration Services\nRead the following documents (Responsible: Group leader):\nCompany rules\nHome office rules\nSafety instructions\nSAFe (Scaled Agile Framework) methodology\nCheck that you have access to the systems we use on a daily basis\nSee TE systems. Do not forget to read the remarks for each system/service, not all of them are relevant for you!",
  "Complete your profile in \n and \n (check the links for information about how to do it). Jira\nConfluence\nUpload a picture to your profile in our main communication platform (Microsoft365), so that people can identify you easily the first time they \nmeet you in person. During the first days HR team will send you an email in order to schedule a photo shoot session to get a profile picture you can use \nin all company systems.",
  "Upload the picture to any other profile you might have in the different company systems (e.g. Jira)\n*) Please send the documents to \n. If you want to print the documents for signing, please print only the last page of each \nhr@technica-engineering.de\ndocument for the sake of the environment, this is perfectly sufficient!",
  "From this point onward, and for the next weeks, your time will be invested in basically 3 tasks:\nConfiguring your laptop: The most boring point, it will take you some days, but can be done anytime, little by little. As soon as you got your \nlaptop, you can start with all the setup required before you can actually start working. Bare in mind that in order to be able to download some \ntools, you will have to request admin rights from the IT team.",
  "More information in \n section. TE systems\nAttending to workshops: You don’t have to worry about it, just wait for the appointments and directions about what to do and when. Theory and practice.",
  "This part will be mainly handled by the \n. TE Academy\nYou should have already a bunch of appointment invitations that correspond to all the training sessions planned for the \nmonth you start in (or the next available training cycle). Please check the content of each appointment together with your supervisor and accept those that are interesting/relevant \nfor you according to your profile and experience, and reject the rest.",
  "Q&A sessions\nReading documentation: The biggest “package”. Below you can find some hints about where to start and which sequence to follow to read \nthe available documentation. Get familiar with our intranet: If you have never used Confluence (the system our intranet is built on) or you don't feel confident using it, \nplease take a look at our articles \n and \n.",
  "Confluence\nConfluence Tutorial: Main features\nThe information collected in all the presentations used during the onboarding comes from and is explained more in detail in our \nintranet, so please take your time to browse the system (do not forget to use the search functionality, it is quite powerful!). Regarding the initial training (involving configuration, workshops and documentation,etc..), a customized version, adapted to your needs, will be \ndeveloped and handled by your supervisor/group leader depending on the project(s) you will be involved in. Within the first few weeks, your supervisor \nwill guide you through it, so don't you worry \n.",
  "blocked URL\n \nCompany overview\nIn this sections we try to describe all the information that can be useful for you to get familiar with the company and all the systems and processes we \nhave. Organizational Chart\nTechnica Engineering GmbH, all rights reserved\nPage 3 of 12\nDuring your work here, you will probably need to interact with several people from various teams. Therefore, it's important to know all the departments \nand how they are distributed among the company's hierarchy.",
  "For the matter, we invite you to visit the following link which bings you to the official and \ncomplete organizational chart:  \nTE org chart (in Rexx system)\nThis org chart is maintained by our HR team and always up-to-date. If you are interested in getting information about employees in relation to \ndepartments, groups and supervisors, this is the right place. If you are new in the company, there will be a lot of new names - people, departments, teams, projects... - but do not panic.",
  "Little by little, you will get \nto know all the departments and teams mentioned there and associate a face to each name. That will happen especially during company and team \nbuilding events. For further details and context regarding each area and department, feel free to check the subsections:\nEnabling Functions\nAdministration\nHR\nMarketing\nBusiness Development\nQuality Management\nTechnical Departments\n[Outdated] Architecture & Platform\nEngineering\nFunctional Integration\nLogistics & Production\nNetwork Technology and Basic Functions\nPortfolio ZSG\nTest Infrastructure\nTechnical Fellows\nMore details about the company, its structure and what we do can be found in our main intranet site, \n.",
  "Technica Engineering\nPolicies & Processes\nTo meet our obligations and continuously improve, we are certified in ISO 9001 (Quality), ISO 14001 (Environmental Protection), and TISAX \n(Information Security). For this purpose, a Management System - which is a set of policies, processes, and procedures used to ensure compliance \nwith the requirements of certifications - has been established. More information about this can be found here:\nManagement Handbook\nThe main processes and policies can be found on the \n.",
  "Here quick links:\nintranet\nPolicies\nProcesses\nPlease start reading carefully the \n, since they \ncompany policies\ngovern how the company must operate internally and all employees must be aware of \nthem to guarantee a good working environment and to meet up with our quality standards. We recommend to follow the sequence below:\nFirst of all, please read carefully our \n. Special attention to the following points, since they seem to be very often overlooked or not \nHR policy\ncarefully read:\nProject structure\nA company's organization chart contains information from the disciplinary point of view (\"who reports to whom\"?, so to speak).",
  "If what you \nare looking for information about the organization of the company on a technical level, in relation to projects:\nExisting projects\nProject responsible\nProject roles\nDepartments/groups involved\n...\nyou will not find this information in the org chart. We are working on centralizing all this information ina project controlling toolchain which \nwill be available for the employees in year 2024. Until then, if you are looking for project-related information and don't know where to start \nfrom, please send an email to \n and we'll provide the required information.",
  "documentation@technica-engineering.de\nTechnica Engineering GmbH, all rights reserved\nPage 4 of 12\n1. 2.  \na.  \nb. 3.  \na.",
  "4. 5. 1.",
  "2.  \na.  \ni.  \nii. 3. 4.",
  "General rules about working hours\nSpecific rules about flexible working hours\nincluding home office\nRules regarding vacation days\nHow (and when) to inform about a sick leave\nThen take a look also to the data protection rules in the following documents:\nPrivacy Policy\nInformation Security\nThen move to the rest of the policies, in whichever order you prefer. After reading the policies, please move forward to the section related to the \n, where you will find two subsections:\ncompany processes\nDaily-use processes are those workflows or how-to's (sets of instructions) defined to request services, hand in required-documentation and \nother processes part of the daily business. Formal processes refer to the management processes formally required by the ISO 9001 certification to guarantee a good quality.",
  "As complement, you can read more about quality measures to be applied on a daily basis in our article about \n. ISO 9001\nLast but not least, please check our document about \n, which explains the principles that we want to promote in our company. Please \n5S methodology\nread it as well and try to apply those principles at work since the first day.",
  "Home office\nTechnica Engineering offers to all the employees \n the possibility to do home office, according to the rules \nthat have passed the probation period\nexplained in our \n. There you will find information about:\nHome office guidelines\nBasic rules\nWhy \nHow\nWhat-if\nData protection rules in the context of home office\nIn order to be eligible for home office, the last slide of the Home office guidelines needs to be printed out, signed and sent to HR. Once the data protection agreement has been signed and accepted, the process to request a day of home office is as follows:\nCreate a home office request in our \n.",
  "time tracking system\nYour supervisor will receive the request, check it and reply\nIn case of approval, request will be accepted in the system, with no further information (no message back)\nIn case of rejection, appointment will be rejected together with a message explaining the reason for that rejection\nIf the home office request has been accepted, the people you work with (usually, only the rest of the team members) must be informed about \nit\nThis can be achieved by extending the list of recipients of the Outlook appointment initially sent only to the group leader\n[optional] Create an Outlook appointment with the subject \"X home office\", where X is your first name (and surname, in case there is more \none person in the company with the same name) and send it to whomever you want to inform about your home office (if any)\nPlease create always the appointment as a full-day event, \n and showing you as \n in the calendar. If you do not know \nwithout reminder\nfree\nhow to do all this, please ask a colleague. And that's all \nRemember that it is mandatory to be reachable all the time while you are doing home office, so please make sure to be online in Teams and per \nemail.",
  "Same rules for lunch and other breaks apply as if you were working in the office. It is on the group leader's responsibility to decide whether home office in situations out of the rules mentioned above is applied or not. In those cases, \neach request will be analyzed separately and accepted/rejected as a result of this analysis.",
  "Out of office\nThe process to request days off is described below:\nSend an official request to your group leader through the \n. time tracking system\nOnce the request is approved, create an Outlook appointment with the subject \"X out of office\", where X is your first name (and surname, in \ncase there is more one person in the company with the same name), to all the people you work with (usually, only the team members, \nincluding the group leader) to inform them\nPlease create \n the appointment as\nalways\na full-day event, even if you are idle for half a day or just a couple of hours. You can provide details in the appointment \ndescription.",
  "without reminder and showing you as \n in the calendar. If you do not know how to do all this, please ask a colleague. free\nWait until this point to buy the flight tickets or book anything.",
  "If you do it earlier and either the request is not approved or it is approved but \ncancelled later, you will not receive any compensation from the company (this is so by law in Germany). Prepare your \"out-of-office\" message. Technica Engineering GmbH, all rights reserved\nPage 5 of 12\nTime tracking\nDuring the onboarding session, all employees get a brief overview on our \n.",
  "If you need more details about its use, please check \ntime tracking system\nthe article dedicated to this system: \n. Rexx\nIf, on the contrary, you are more interested in the underlying rules regarding working hours, vacation days, sick days, etc., please check our Company \n in detail. Policies\nAccess chip\nAccess to all rooms is controlled via a permission system.",
  "To grant the right access to each room, each employee has a programmable chip that is so \nconfigured that only allows access to the required rooms. This chip will be provided by HR also in the first working days, as described in How-To: \n. Manage office access permissions\nPlease check the first day(s) if your chip is working fine in all the locations and rooms you will required access.",
  "In case not, contact directly our \ncolleagues from HR. The access chip is tied to your user account in our \n, and therefore can be used for clocking in and out, as explained during the \ntime tracking system\nonboarding session. Visitors\nFor security reasons (due to the confidential character of many of the data we handle daily at work), all visitors have to register at the company's \nreception.",
  "This is done via \n system, which can be either accessible online or by using the terminal available on the reception desk. The full \nProxyclick\nprocess is described in \n. How-To: Handle a customer visit\nAfter successful registration, the host will receive an email informing that their visitor arrived so that they can be picked up from the waiting area \nopposite to administration.",
  "Intranet\nIn order to access to the Technica intranet - and all the systems used on a daily basis, with a couple of exceptions - from outside the facilities of the \ncompany, you will need to connect to the company’s VPN. If not given within the first week, and in case you see you will need it, please request to \nyour supervisor a VPN certificate. The app OpenVPN comes preinstall on all laptops provided to the employees.",
  "This tool is used for managing VPN certificates and install the received \ncertificate. Instructions on how to use it can be found in our IT's section about \n. VPN\nMail\nAll new employees are welcome on their first working day by our colleagues from HR and Administration, who take care of, among other information, \nprovide the basic information for you to start your journey at Technica Engineering.",
  "One of the things you get is your new TE email address. With this, \nyou will have access to most of the services provided by the company. First, you'll need to check your login data for your Microsoft365 account (including email), official platform used at Technica: \nUsername: max.mustermann@technica-engineering.de\nPassword You will get an initial one, auto-generated, in paper form from HR\n: \nIf not working, please perform a password reset with the option “Forgot your password?” \nRecommendations regarding the email account:\nUse the standalone MS Outlook app instead of the web interface, which is less powerful and not so user-friendly.",
  "Set a signature to be used in all the emails you send (see \n for more details). Signature\nSet an \"out-of-office\" message every time you take days off or while on sick leave (see \n for more details). Out of office\nGet used from the first day to create folders to archive your emails.",
  "This will help you find the information more easily in the future, when the \namount of emails will be pretty high. In the \n section you will find a list of commonly used email addresses within Technica and what to use them for. Contacts\nPGP encryption\nWhenever working with confidential information, any document or data containing sensitive information that is sent or received via email within people \ninside or outside the company must be encrypted.",
  "Technica Engineering GmbH, all rights reserved\nPage 6 of 12\nPGP will be used as encryption system. For instructions on how to configure your laptop to use it, please check \n. Email Encryption with PGP\n Note that both parts of the communication need to use PGP.",
  "Please share your public key with whomever you will exchange this encrypted data. Signature\nPlease check the \n section to find the latest guidelines for email signature. Corporate Design\nOut of office\nPlease activate the \"out-of-office\" automatic reply in Outlook every time you have some days off or you are on sick leave.",
  "Below you can find a sample \ntext you can use:\nVielen Dank für Ihre E-Mail. Ich bin bis einschließlich XX.XX.20XX nicht erreichbar. Während meiner Abwesenheit wird Ihre \nNachricht nicht automatisch weitergeleitet.",
  "Nach meiner Rückkehr werde ich Ihre Email schnellstmöglich bearbeiten. In dringenden Fällen wenden Sie sich an: name.surname@technica-engineering.de\nThank you for your e-mail. I am out of the office until XX.XX.20XX.",
  "During my absence, your e-mail/message will not be \nforwarded. I will process your email as soon as possible after my return. In urgent cases, please contact: name.surname@technica-engineering.de\nMit freundlichen Grüßen/Best regards\nResources\nMeeting rooms\nWe have several meeting rooms in our offices.",
  "These can be booked via Outlook by creating a new appointment. The exact process is explained in Ho\n. w-To: Book a meeting room\nTransportation\nThe company puts several means of transportation at the disposal of the employees to attend to meetings at the customer’s premises or any other \nwork-related need.",
  "The process to book them and the usage rules are described in the following \n. Car/Vehicle Management for business trips (DE/EN)\nCorporative image\nTo maintain a common format for all Technica Engineering's official documents the company has defined rules and guidelines to follow. Details can be \nfound in \n.",
  "Corporate Design\nServices/sites\nBelow you can find an overview of the services/tools currently available at Technica Engineering:\nImportant\nFor IT help on low-level topics like network, security, etc. related to any of our systems or services, please browse the content in IT Service \n. For documentation on a user level, please take a look at our articles about the \n in our \nDesk\ncompany's software infrastructure\nknowledgebase\n.",
  "Technica Engineering GmbH, all rights reserved\nPage 7 of 12\nTable of contents\nComputer\nNetwork\nWebsites\nAccounting\nHR & Administration\nProductivity\nFile/Document management\nEngineering & Development\nService\nData \nlocation\nPurpose\nUser \nname\nPassword\nLink\nComment\nComputer\nTE Windows login\nN/A\nOfficial computer's operating system. NOTE: In special cases, and upon approval, Linux or \nMac computers are allowed, but official support is \nonly guaranteed 100% for Windows computers. Working on increasing the support coverage to \ninclude also other operating systems.",
  "mmuster\nmann\nTE*\nN/A\nUsername and password are \nprovided by IT team on the first \nworking day. NOTE: The login data (user\n/password) used on the employee's \ncomputer is used widely in the \ncompany for all those systems that \nallow synchronization with to our \ncentralized directory service for the \nlogin. *) TE = Technica Engineering's Active \nDirectory.",
  "Microsoft's own directory \nservice for use in Windows domain \nnetworks that provides authentication \nand authorization functions. From now on, all systems using this \ncombination of user and password as \nlogin data will be identified with \"TE\" \nin the \n column. In case \npassword\ndifferent login data is needed, it will \nbe so specified.",
  "Network\nTE OpenVPN\nN/A\nTool that implements Virtual Private Networks (VPN). Used to access content from outside Technica office \nthat is only available from within the Technica \nnetwork due to security reasons. mmuster\nmann\nTE\nN/A\nTE (Windows) login data\n System documentation: VPN \nConfiguration\nWebsites\nTE Website\nCloud\nOfficial company website for external use.",
  "-\n-\nhttps://technica-\nengineering.de/\nTE Intranet\nOn-\npremises\nOfficial company website for internal user, where the \nbasic company information can be found. mmuster\nmann\nTE\nhttps://confluence. technica-\nengineering.net\n/display/TE/\nTE (Windows) login data\nOnly accessible from the TE network.",
  "Old intranet, based on SharePoint, \nwas accessible via:\n>> https://technicaengineering. sharepoint.com/portal/SitePages\n/Home.aspx\nTE Customer portal\nOn-\npremises\nSystem developed for our customers to be able to \nsecurely access data of their purchased products, \ndownload specific content and learn more about our \nproducts in the knowledge base. Also useful (and accessible) for employees that \nmake use of our HW products.",
  "max. musterm\nann@tec\nhnica-\nengineeri\nng.de\nFree election\nhttps://portal. technica-\nengineering.de\nSign up required before first use.",
  "Released in May 2023. System documentation: Customer \nPortal\nTechnica Engineering GmbH, all rights reserved\nPage 8 of 12\nTE Wiki\nOn-\npremises\nCollaborative tool for documentation. Each department, group or project is free to create \nthere a so-called \n to document there \nspace\nprocesses, how-to's, FAQ, or any other relevant \ninformation to be shared internally.",
  "A few company-wide \n are also available for all \nspaces\nemployees:\nTechnica Engineering\nTE Academy\nTE Knowledgebase\nIT Service Desk\nBuilt using \n system. For that reason, wiki \nConfluence\nis often referred to as \n, and both names \nConfluence\nare used interchangeably\nmmuster\nmann\nTE\nhttps://confluence. technica-\nengineering.net\nTE (Windows) login data\nRegistration: To get an initial \npassword, follow the process to reset \npassword and set the same password \nas for AD.",
  "If done already for Jira, no \nneed to repeat the process\n System documentation: Confluence\n. Accounting\nTE DATEV\nfor Employees\nOBSOLETE\nPayrolls now available \nin new HR system, \nreleased in Q3 2023\nCloud\nGerman accounting software where employees can \nfind their payrolls every month\nmax. musterm\nann@tec\nhnica-\nengineeri\nng.de\nFree election\nhttps://apps.datev.",
  "de/ano/\nRegistration data will be sent to the \nemployee per post. If you are new in the company, \nplease make sure that we have your \ncurrent address. Otherwise the letter \nwill get lost and no registration in \nDATEV is possible.",
  "Access only after first payroll is \ngenerated and sent out. TE DATEV\nfor Accounting team\nOn-\npremises\nGerman accounting software\nmmuster\nmann\nTE\nN/A (Standalone \napp installed on \nserver)\nConnection to DATEV server via \nremote desktop\nTE HS\nOn-\npremises\nInventory system\nIt manages the production from the TE Products. Request \nto IT via \nService \nDesk\nTE + Extra \npassword\nN/A (Standalone \napp installed on \nserver)\nConnection to HS server via remote \ndesktop\nHS = Hamburger Software.",
  "HR & Administration\nTE DATEV \nfor Employees\nOBSOLETE\nPayrolls now available \nin new HR system, \nreleased in Q3 2023\nOn-\npremises\nAccounting system where you can find your payrolls. max. musterm\nann\nSent via \npostal mail\nhttps://www.datev.",
  "de/ano/\nLogin data will be sent per mail to \nyour place of residence\nTE Rexx\nCloud\nHR system. It contains information about the employee profile, \nyearly appraisals, leave requests and time tracking, \namong others. mmuster\nmann\n-\nhttps://technica.",
  "rexx-systems.com\nSingle-sign on: System linked to \nOffice 365 account, login should take \nplace automatically if you are logged \nin in Microsoft systems already\n System documentation:\n. Rexx\nTE Engage! OBSOLETE\nIncluded in new HR \nsystem, released in Q3 \n2023\nOn-\npremises\nHR system.",
  "It contains information about the employee profile, \nskills assessment and internal open positions, \namong others. mmuster\nmann\nTE\nhttps://hr.technica-\nengineering.net\nTE (Windows) login data\nSince the platform is connected to the \npayroll system, users can be only \nregistered in the system after their \nfirst payroll. System documentation: In case \nof questions, please check the user \nmanuals.",
  "TE Org Chart\nOBSOLETE\nIncluded in new HR \nsystem, released in Q3 \n2023\nOn-\npremises\nOrg chart of the company (for now, Munich only). -\n-\nhttp://192. 168.110.76:81\n/orgmanager/\nLast update: Beginning 2022\nTechnica Engineering GmbH, all rights reserved\nPage 9 of 12\nTE Time Tracking\nOBSOLETE\nIncluded in new HR \nsystem, released in Q3 \n2023\nOn-\npremises\nTime tracking system, used for:\nTime recording (clock-in/-out)\nProject assignment (time invested per project)\nLeave request\nmax.",
  "musterm\nann\nFree election\nhttps://timetracking. technica-\nengineering.net/\nInitial password: empty\n System documentation: \n. Bedatime\nTE Recruitee\nCloud\nRecruiting Tool for applications\nmax.",
  "musterm\nann@tec\nhnica-\nengineeri\nng.de\nExtra \npassword\nhttps://app. recruitee.com/\nAsk mycareer@technica-engineering. for access if needed\nde\nTE ProxyClick\nCloud\nVisitor tracking system.",
  "All external visits must be \nregistered in the system, keeping track of reason of \nthe visit, arrival and departure time, and contact \nperson(s) at Technica Engineering. max. musterm\nann@tec\nhnica-\nengineeri\nng.de\nFree election\nhttps://app.",
  "proxyclick.com/CO-\nCNVP912\n/dashboard\nTE Help Center\nOn-\npremises\nHelp-Desk platform, used for customer support and \nas employee self-service portal:\nIT Service Desk\nAdministration Service Desk\nBased on \n system. Often \nJira Service Management\nreferred as Jira SD (SD = Service Desk). mmuster\nmann\nTE\nhttps://jira.technica-\nengineering.net\n/servicedesk\n/customer/portals\nTE (Windows) login data\nTE SnipeIT\nOn-\npremises\ninventory system\nmmuster\nmann\nTE\nhttps://snipeit.",
  "technica-\nengineering.net\nTE (Windows) login data\nProductivity\nTE Microsoft 365\nCloud\nMicrosoft office suite (incl. email). max.",
  "musterm\nann@tec\nhnica-\nengineeri\nng.de\nFree election\nhttps://login. microsoftonline. com/\nEmail and password are provided by \nHR on the first working day\n System documentation: Microsoft \n.",
  "365\nTE Email\nCloud\nOfficial company email system. max. musterm\nann@tec\nhnica-\nengineeri\nng.de\nSame as \nMicrosoft 365\nhttps://outlook.",
  "office.com/owa/ or \nwith the traditional \nstandalone app, \npreinstalled on the \ncomputers by \ndefault\nMicrosoft 365 login data\n System documentation: \n. Outlook\nTE Skype for Business\nOBSOLETE\nReplaced by MS Teams\nCloud\nInstant messaging enterprise app. Used for individual chats.",
  "max. musterm\nann@tec\nhnica-\nengineeri\nng.de\nSame as \nMicrosoft 365\nStandalone \napp,  preinstalled \non the computers \nby default\nMicrosoft 365 login data\nTE Teams\nCloud\nUnified communication platform that combines \npersistent workplace chat, video meetings, file \nstorage, and application integration. User mainly for chats and online meetings.",
  "max. musterm\nann@tec\nhnica-\nengineeri\nng.de\nSame as \nMicrosoft 365\nhttps://teams. microsoft.com\nMicrosoft 365 login data\nTE Jira\nOn-\npremises\nTask management system.",
  "Used to organize and track individual and group\n/project tasks. mmuster\nmann\nTE\nhttps://jira.technica-\nengineering.net/\nTE (Windows) login data\nPlease log in once asap in order to \nactivate your account. Until then, no \naccess rights can be granted to your \nuser.",
  "To get an initial password, follow the \nprocess to reset password and set \nthe same password as for TE \n(Windows)\n System documentation: \n. Jira\nTechnica Engineering GmbH, all rights reserved\nPage 10 of 12\nTE Translator\nOn-\npremises\nOnly approved translator tool approved for \ntranslating confidential data, from customer emails to \nrequirements, internal projects, etc. -\n-\nhttps://translate.",
  "technica-\nengineering.net/\n DO NOT USE cloud-based \nsystems like:\nGoogle Translate\nDeepL\nChatGPT\nGoogle Gemini\nNo cloud-service is to be used to \ntranslate content that contains - \ndirectly or indirectly, confidential \ninformation about internal or \ncustomer projects. File/Document management\nTE SharePoint\nCloud\nFile hosting and documentation service. << Partially obsolete >> For documentation, system \nreplaced by Confluence (see further below).",
  "max. musterm\nann@tec\nhnica-\nengineeri\nng.de\nSame as \nMicrosoft 365\nhttps://technicaengi\nneering.sharepoint. com\nMicrosoft 365 login data\n System documentation: SharePoi\n.",
  "nt / OneDrive\nTE OneDrive\nCloud\nFile hosting and synchronization service. On the cloud. Thus, used only for \n \nnon-confidential\ninformation.",
  "max. musterm\nann@tec\nhnica-\nengineeri\nng.de\nSame as \nMicrosoft 365\nhttps://technicaengi\nneering-my. sharepoint.com/\nMicrosoft 365 login data\n System documentation: SharePoi\n.",
  "nt / OneDrive\nTE TECS\nOn-\npremises\nFile hosting service. On TE servers. Thus, \n \nsuitable for confidential\ninformation.",
  "TE\\mmus\ntermann\nTE\n\\\\10.21.2.200\nAdditionally, tools \nand exchange \nfolders can be \nfound in:\n\\\\10.21.2.100\n\\Tools\n\\\\dfs\\Exchan\nge: For \ninternal \nexchange of \nconfidential \ninformation\nConten\nt \ndeleted\nautom\natically\nat the \nbeginni\nng of \neach \nmonth\nTE (Windows) login data\n System documentation: \n. TECS\nTE NextCloud\nPrivate \nCloud \n(IaaS)\nExchange server for TE and customers or people \noutside the company with an auto-deletion of files \n. Dropbox-like system.",
  "after 30 days\nRequest \nto IT via \nService \nDesk\n-\nhttps://xchange2. technica-\nengineering.de/\nIf you have never used the system, \nplease contact IT to get a username. To meet TISAX requirements all files \nstored in \n are server-side \nNextCloud\nencrypted (encryption at rest).",
  "TE NextCloud LTS\nPrivate \nCloud \n(IaaS)\nExchange server for long term storage (LTS) \n after X days. It \nwithout an auto-deletion of files\nprovides less quota per user and should just used for \nprojects or really special needs. Request \nto IT via \nService \nDesk\n-\nhttps://xchange2-\nlts.technica-\nengineering.de/\nTo meet TISAX requirements all files \nstored in \n are server-side \nNextCloud\nencrypted (encryption at rest).",
  "TE FTP\nCloud\nhttps://files.technica-engineering.de/ is used to \nprovide a public website for clients to download \nsetups like ANDi. -\n-\nhttps://files. technica-\nengineering.de/\nThis folder is reachable via SFTP port \n22 from the TE public IP address in \nLeopoldstraße to upload files.",
  "Engineering & Development\nTE Jira\nOn-\npremises\nIssue tracking system. Used to report SW bugs and manage team tasks\nmmuster\nmann\nTE\nhttps://jira.technica-\nengineering.net/\nTE (Windows) login data\nPlease log in once asap in order to \nactivate your account. Until then, no \naccess rights can be granted to your \nuser.",
  "To get an initial password, follow the \nprocess to reset password and set \nthe same password as for AD\n System documentation: \n. Jira\nTechnica Engineering GmbH, all rights reserved\nPage 11 of 12\nTE Jenkins\nOn-\npremises\nCI (Continuous Integration) system. Used for automation tasks like test execution, source \ncode compilation & quality checks, etc.",
  "mmuster\nmann\nTE\nhttps://jenkins2. technica-\nengineering.net/\nhttps://jenkins3. technica-\nengineering.net/\nhttps://jenkins4.",
  "technica-\nengineering.net/\nhttps://jenkins5. technica-\nengineering.net/\nhttps://jenkins6. technica-\nengineering.net/\nTE (Windows) login data\nBy default, no access is given to this \nsystem.",
  "If needed, email to IT must \nbe sent, requesting access\n System documentation: \n. Jenkins\nTE SonarQube\nOn-\npremises\nSystem for continuous inspection of code quality. It performs automatic reviews with static analysis of \ncode to detect bugs, code smells, and security \nvulnerabilities on 20+ programming languages.",
  "mmuster\nmann\nTE\nhttps://sonar. technica-\nengineering.net\nTE (Windows) login data\nTE Gitlab\nOn-\npremises\nWeb-based DevOps lifecycle tool that provides a Git \nrepository manage. Git is the official \n at Technica\nVCS\nmmuster\nmann\nTE\nhttps://git.technica-\nengineering.net\nTE (Windows) login data\nGitLab Community edition in use.",
  "Please log in once asap in order \nto activate your account. Until then, \nno access rights can be granted to \nyour user. TE Nexus\nOn-\npremises\nRepository Management for binaries and build \nartifacts\nmmuster\nmann\nTE\nhttps://nexus.",
  "technica-\nengineering.net\nTE (Windows) login data\nTE SVN\nOn-\npremises\nVersion Control System. Currently used only in old projects. All new projects \nare hosted in Git repositories\nmmuster\nmann\nTE\nN/A\nTE (Windows) login data\nTraining program\nAt the beginning of the probation period, a personalized training plan will be designed by the supervisor, based on the following template:\nISO_Einarbeitungsplan_DEU_24.02.2025_V1.7.docx\nThe goal of this plan is to serve as guidance through the training process of any new member.",
  "This will be handled by your group leader, as \ndisciplinary responsible. You'll only have to follow their instructions/advice and provide feedback regularly. Once the training phase - usually 6 months - is over,  checklist will be reviewed in order to identify if the employee member has received the required \ntraining, and to define measurements if that's not the case.",
  "This checklist will be handed in to HR then, for tracking purposes. Support documents\nDocumentation to support the training plan can be found in:\nTE Academy\nProject started in mid 2022 to get a centralized training system for the employees, starting from the newcomers and following with \nany employee, with the goal of developing their skills and fill in possible knowledge gaps, as well as promoting the know-how \ntransfer among employees. Here you can find, among other things, the presentations used during the onboarding session:\nCompany Onboarding\nTE Knowledgebase\nProject started also in 2022, in parallel to the TE Academy, with the goal of centralizing any piece of information that is virtually for \nall employees, or most of them, in order to promote the collaboration and minimize the duplicate documentation work.",
  "In case you are new to the automotive industry, the following links can help you to gain an overview of some of the most basic concepts:\nAUTOSAR: https://automotivetechis.wordpress.com/autosar-concepts/\nISO-26262 Functional safety: https://automotivetechis.wordpress.com/iso-26262/\nTechnica Engineering GmbH, all rights reserved\nPage 12 of 12\nWikipedia is also a good starting point for people with a technical profile. Typical concepts you will hear about at Technica Engineering are:\nECU: https://en.wikipedia.org/wiki/Electronic_control_unit\nFIBEX: https://en.wikipedia.org/wiki/Fibex\nAUTOSAR: https://en.wikipedia.org/wiki/AUTOSAR\nBasic Software: https://automotive.wiki/index.php/Basic_Software_Module\nISO-26262 Functional safety: https://en.wikipedia.org/wiki/ISO_26262\nASIL: https://en.wikipedia.org/wiki/Automotive_Safety_Integrity_Level\nVehicle bus: https://en.wikipedia.org/wiki/Vehicle_bus\nEthernet: https://en.wikipedia.org/wiki/BroadR-Reach\nCAN: \n \nhttps://en.wikipedia.org/wiki/CAN_bus\nLIN: https://en.wikipedia.org/wiki/Local_Interconnect_Network\nFlexRay: https://en.wikipedia.org/wiki/FlexRay\nMOST: https://en.wikipedia.org/wiki/MOST_Bus\nSPI: https://en.wikipedia.org/wiki/Serial_Peripheral_Interface_Bus\nDiagnostics: https://en.wikipedia.org/wiki/Unified_Diagnostic_Services\nCertifications\nThe access to certifications is described in the article \n. How-To: Request external courses or certifications\nLanguage courses\nPlease check the article \n to get more details about the options we currently offer for those who don't speak (or \nHow-To: Access to language courses\nwant to improve their) English or German.",
  "Employee benefits\nFlexible hours, meal vouchers, summer picnics, days dedicated to wellness, online or company learning courses, family support, gym tickets: these \ncan represent just a few examples of company benefits (or “perks”) that many companies provide for their employees, and Technica Engineering is - \nluckily - one of them. The goal? To increase staff well-being and contribute to improving the work environment.",
  "Part of these benefits are presented during the onboarding session on the first working day. Please check details about the \n system \nemployee benefits\nwe have built if you want to know more. Other\nIf you are missing anything in this guide, please do not hesitate to \n your request/suggestion.",
  "send us\nIf you have general questions, your supervisor\n/group leader or the \n will be happy to help. HR department"
]